//Device Last Seen time
//Built by my wonderful colleague, Andrea Fisher

let info = DeviceInfo
| project DeviceId, DeviceName, OnboardingStatus, OSPlatform, OSVersion;
let seen = DeviceTvmSoftwareEvidenceBeta
| project DeviceId, LastSeenTime;
let finallist = info
| join kind=inner (seen) on DeviceId
| project DeviceId, LastSeenTime, DeviceName, OnboardingStatus, OSPlatform, OSVersion;
finallist
| project DeviceName, LastSeenTime, OnboardingStatus, OSPlatform, OSVersion
