//Track when someone makes MDC portal environment settings

AzureActivity
| where OperationNameValue == "MICROSOFT.OPERATIONSMANAGEMENT/SOLUTIONS/WRITE"
| where ActivityStatusValue == "Success"
| mv-expand Prop = Properties_d.resource to typeof(string)
| distinct Caller, CallerIpAddress, ResourceGroup, Prop
